; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v3 - type_1 ?v4 - type_2)
 	      (pred_1 ?v2 - object ?v4 - type_2)
	      (pred_4 ?v3 - type_1 ?v5 - type_3)
	      (pred_2 ?v3 - type_1 ?v2 - object ?v5 - type_3))

   (:action op_1
       :parameters  (?v3 - type_1 ?v7 ?v6 - type_2)
       :precondition (and  (pred_3 ?v3 ?v7))
       :effect (and  (pred_3 ?v3 ?v6)
		     (not (pred_3 ?v3 ?v7))))

   (:action op_3
       :parameters (?v3 - type_1 ?v1 - object ?v8 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v1 ?v8) (pred_3 ?v3 ?v8) (pred_4 ?v3 ?v5))
       :effect (and (pred_2 ?v3 ?v1 ?v5)
		    (not (pred_1 ?v1 ?v8)) 
		    (not (pred_4 ?v3 ?v5))))

   (:action op_2
       :parameters (?v3 - type_1 ?v1 - object ?v8 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_2 ?v3 ?v1 ?v5) (pred_3 ?v3 ?v8))
       :effect (and (pred_1 ?v1 ?v8)
		    (pred_4 ?v3 ?v5)
		    (not (pred_2 ?v3 ?v1 ?v5)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_07 obj_01 - type_1
obj_09 obj_03 obj_11 obj_04 - type_3
obj_02 obj_06 obj_10 - type_2
obj_05 obj_08 obj_12 - object)
(:init
(pred_3 obj_07 obj_02)
(pred_4 obj_07 obj_09)
(pred_4 obj_07 obj_03)
(pred_3 obj_01 obj_10)
(pred_4 obj_01 obj_11)
(pred_4 obj_01 obj_04)
(pred_1 obj_05 obj_02)
(pred_1 obj_08 obj_06)
(pred_1 obj_12 obj_06)
)
(:goal
(and
(pred_1 obj_05 obj_10)
(pred_1 obj_08 obj_06)
(pred_1 obj_12 obj_06)
)
)

(:constraints
  (always (not (pred_3 obj_07 obj_10)))
)
)

; plan
1. (op_1 obj_01 obj_10 obj_02)
   deleted: (pred_3 obj_01 obj_10)
   added: (pred_3 obj_01 obj_02)
   goals met: 2 of 3
2. (op_3 obj_01 obj_05 obj_02 obj_04)
   deleted: (pred_1 obj_05 obj_02) (pred_4 obj_01 obj_04)
   added: (pred_2 obj_01 obj_05 obj_04)
   goals met: 2 of 3
3. (op_1 obj_01 obj_02 obj_10)
   deleted: (pred_3 obj_01 obj_02)
   added: (pred_3 obj_01 obj_10)
   goals met: 2 of 3
4. (op_2 obj_01 obj_05 obj_10 obj_04)
   deleted: (pred_2 obj_01 obj_05 obj_04)
   added: (pred_1 obj_05 obj_10) (pred_4 obj_01 obj_04)
   goals met: 3 of 3
